# Built In Failures Electrical Failures No Panel Circuit Become ASpare Property

Source: https://www.revitapidocs.com/2026/c8853f1b-cc42-53c1-585f-fc9305d64b7d.htm

---

| Built In Failures Electrical Failures No Panel Circuit Become ASpare Property |
| --- |

Circuit \[Circuit Name] in the model has become a spare because all connected elements have been disconnected. Click Delete if you want to remove the Spare, click OK to preserve the Spare..
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId NoPanelCircuitBecomeASpare { get; }
```

```
Public Shared ReadOnly Property NoPanelCircuitBecomeASpare As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ NoPanelCircuitBecomeASpare {
	FailureDefinitionId^ get ();
}
```

```
static member NoPanelCircuitBecomeASpare : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ElectricalFailures Class Autodesk.Revit.DB Namespace